app/views/collection_points/_form.html.erb

SELECT "recyclable_materials"."id" FROM "recyclable_materials" INNER JOIN "collection_points_recyclable_materials" ON "recyclable_materials"."id" = "collection_points_recyclable_materials"."recyclable_material_id" WHERE "collection_points_recyclable_materials"."collection_point_id" = $1  [["collection_point_id", 2]]
---
        <label>
          <%= check_box_tag "collection_point[recyclable_material_ids][]", material.id, collection_point.recyclable_material_ids.include?(material.id), class: "filled-in", id: "collection_point_recyclable_material_ids_#{material.id}" %>