app/controllers/collection_points_controller.rb

SELECT "collection_points".* FROM "collection_points" WHERE (name ILIKE '%Leroy%')
---
  def index
    @collection_points = CollectionPoint.all

SELECT "recyclable_materials".* FROM "recyclable_materials"
---
  def new
    @collection_point = CollectionPoint.new
    @recyclable_materials = RecyclableMaterial.all

SELECT "recyclable_materials".* FROM "recyclable_materials"
---
  def edit
    @recyclable_materials = RecyclableMaterial.all

INSERT INTO "collection_points" ("name", "address", "latitude", "longitude", "contact", "website", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @collection_point = CollectionPoint.new(collection_point_params)

    respond_to do |format|
      if @collection_point.save

UPDATE "collection_points" SET "address" = $1, "contact" = $2, "updated_at" = $3 WHERE "collection_points"."id" = $4  [["address", "Rua Francisco Alves de Almeida, 371, Parque Industrial, Campinas, SP, 13031-650"], ["contact", "(19) 3333-3333"], ["updated_at", "2023-04-20 21:26:43.929942"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @collection_point.update(collection_point_params)

DELETE FROM "collection_points" WHERE "collection_points"."id" = $1  [["id", 3]]
---
  def destroy
    @collection_point.destroy

SELECT "recyclable_materials".* FROM "recyclable_materials" INNER JOIN "collection_points_recyclable_materials" ON "recyclable_materials"."id" = "collection_points_recyclable_materials"."recyclable_material_id" WHERE "collection_points_recyclable_materials"."collection_point_id" = $1  [["collection_point_id", 6]]
SELECT DISTINCT "collection_points".* FROM "collection_points" INNER JOIN "collection_points_recyclable_materials" ON "collection_points_recyclable_materials"."collection_point_id" = "collection_points"."id" INNER JOIN "recyclable_materials" ON "recyclable_materials"."id" = "collection_points_recyclable_materials"."recyclable_material_id" WHERE (lower(collection_points.name) LIKE '%%' OR lower(recyclable_materials.name) LIKE '%%')
---
  def search
    query = params[:query].strip.downcase
    @collection_points = CollectionPoint.joins(:recyclable_materials)
                                        .where('lower(collection_points.name) LIKE :query OR lower(recyclable_materials.name) LIKE :query', query: "%#{query}%")
                                        .distinct

SELECT "recyclable_materials".* FROM "recyclable_materials" WHERE "recyclable_materials"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 1], ["id", 2], ["id", 3], ["id", 7], ["id", 10], ["id", 5], ["id", 4], ["id", 8], ["id", 6], ["id", 9]]
---
  def nearby
    lat = params[:latitude].to_f
    lng = params[:longitude].to_f
    radius = 10 * 1000 # 10 km de raio

    @collection_points = CollectionPoint.select('*')
                                        .from("collection_points, (SELECT '#{lat}'::float AS lat, '#{lng}'::float AS lng) AS user_location")
                                        .where("earth_distance(ll_to_earth(collection_points.latitude, collection_points.longitude), ll_to_earth(user_location.lat, user_location.lng)) <= #{radius}")
                                        .includes(:recyclable_materials)

SELECT "collection_points".* FROM "collection_points" WHERE "collection_points"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_collection_point
    @collection_point = CollectionPoint.find(params[:id])