app/controllers/pages_controller.rb

  def index
    @collection_points = CollectionPoint.all
---
SELECT "collection_points".* FROM "collection_points"