app/controllers/recyclable_materials_controller.rb

  def index
    @recyclable_materials = RecyclableMaterial.all
---
SELECT "recyclable_materials".* FROM "recyclable_materials"

  def create
    @recyclable_material = RecyclableMaterial.new(recyclable_material_params)

    respond_to do |format|
      if @recyclable_material.save
---
INSERT INTO "recyclable_materials" ("name", "description", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "teste"], ["description", ""], ["category", ""], ["created_at", "2023-04-22 20:51:56.529932"], ["updated_at", "2023-04-22 20:51:56.529932"]]

  def destroy
    @recyclable_material.destroy
---
DELETE FROM "recyclable_materials" WHERE "recyclable_materials"."id" = $1  [["id", 11]]

  def set_recyclable_material
    @recyclable_material = RecyclableMaterial.find(params[:id])
---
SELECT "recyclable_materials".* FROM "recyclable_materials" WHERE "recyclable_materials"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]