app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "luquinhasdianin@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-22 21:01:49.542633"], ["updated_at", "2023-04-22 21:01:49.542633"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "1"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-04-22 21:41:23.513582"], ["id", 8]]